{
  "projects": [
    {
      "name": "Scrambled",
      "img": "https://ronaldcoe.github.io/sourcesportfolio/images/scrambled.png",
      "description": "A word-guessing game built with Next.js where users solve daily puzzles across different categories. Players select letter tiles to guess words against a timer and can view a leaderboard of friends' scores. The game includes a simple admin panel for creating new puzzles and supports three languages: English, Spanish, and Russian.",
      "link": "https://scramble-six.vercel.app/",
      "technologies": "React, Next.js, TypeScript, Tailwind, PostgreSQL, Prisma"
    },
    {
      "name": "National Park Finder",
      "img": "https://ronaldcoe.github.io/sourcesportfolio/images/national_app.png",
      "description": "An application that allows users to locate National Parks in any state and view their contact information and opening hours. This project was developed to practice implementing the ArcGIS module and integrates with the National Park Service API.",
      "link": "https://ronaldcoe.github.io/national-park/",
      "technologies": "JavaScript, ArcGIS, HTML, CSS, National Park Service API"
    },
    {
      "name": "Task Manager App",
      "img": "https://ronaldcoe.github.io/sourcesportfolio/images/task_manager.png",
      "description": "A simple, intuitive task tracking application built as a learning project for Node.js, JavaScript, and MongoDB. The app allows users to create, manage, and organize their personal tasks in a user-friendly interface.",
      "link": "https://github.com/ronaldcoe/tasks_manager",
      "technologies": "Node.js, HTML, CSS, MongoDB"
    },
    {
      "name": "Java ATM App",
      "img": "https://ronaldcoe.github.io/sourcesportfolio/images/java.png",
      "description": "A Java application simulating ATM functionality that demonstrates object-oriented programming principles. Users can create accounts, check balances, make deposits, and withdraw money through an interactive console interface.",
      "link": "https://github.com/ronaldcoe/atm_app",
      "technologies": "Java"
    },
    {
      "name": "Python Arcade Game",
      "img": "https://ronaldcoe.github.io/sourcesportfolio/images/arcade.png",
      "description": "A space-themed game created with Python's Arcade library. Players control a spaceship that can move in all directions and must destroy as many meteoroids as possible by shooting lasers with the space key.",
      "link": "https://github.com/ronaldcoe/python-arcade-game",
      "technologies": "Python, Arcade"
    },
    {
      "name": "CrossDrop",
      "img": "https://ronaldcoe.github.io/sourcesportfolio/images/crossdrop.png",
      "description": "A web application developed during a hackathon competition to help students order food online from the school's food venue. The platform aims to reduce wait times by allowing students to place and pay for orders digitally.",
      "link": "https://github.com/Lakeram21/2022Hackaton",
      "technologies": "React, MongoDB, Express, Node.js"
    }
  ]
}